# Assignment 6

### Name: Hasan Mahabub Sayem     
### Mobile: 01832829921

1. Read any csv file (for example titanic data :https://www.kaggle.com/competitions/titanic/data)
1. Remove duplicate
1. Check missing values
1. Fill missing values with any constant value
1. GroupBy mean, median and sum it using any Categorical column 
1. save it as csv file

In [43]:
import pandas as pd

In [44]:
titanic = pd.read_csv("./train.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [118]:
# removing duplicates
unique_titanic = titanic.drop_duplicates()

In [119]:
# checking missing values
unique_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [127]:
# filling titanic Age column missing values with mean value
age_mean_value = titanic['Age'].mean()
unique_titanic['Age'] = unique_titanic['Age'].fillna(age_mean_value)

In [61]:
# filling other missing values
filled_titanic = unique_titanic.fillna('Missing')

Analysing age with Pclass category

In [103]:
age_mean = filled_titanic.groupby('Pclass')['Age'].mean()
age_median = filled_titanic.groupby('Pclass')['Age'].median()
age_sum = filled_titanic.groupby('Pclass')['Age'].sum()

mean_median = pd.merge(age_mean,age_median, how='outer', on='Pclass')
output = pd.merge(mean_median,age_sum, how='outer',on="Pclass")

output.rename(columns={"Age_x":'Mean',
                      "Age_y":'Median',
                       "Age":'Sum',
                      },inplace=True)

In [88]:
# save it as csv file
output.to_csv('output_1.csv')

Analysing fare with sex category

In [99]:
fare_mean = filled_titanic.groupby('Sex')['Fare'].mean()
fare_median = filled_titanic.groupby('Sex')['Fare'].median()
fare_sum = filled_titanic.groupby('Sex')['Fare'].sum()

mean_median = pd.merge(fare_mean,fare_median, how='outer', on='Sex')
output_2 = pd.merge(mean_median,fare_sum, how='outer',on="Sex")

output_2.rename(columns={"Fare_x":'Mean',
                      "Fare_y":'Median',
                       "Fare":'Sum',
                      },inplace=True)
output_2.rename_axis('Fare',axis='columns',inplace=True)

Fare         Mean  Median         Sum
Sex
female  44.479818    23.0  13966.6628
male    25.523893    10.5  14727.2865

In [101]:
# save it as csv file
output_2.to_csv('output_2.csv')